export const API_BASE_URL = "https://api-dev.yearlymailbox.com";

export const COLOR_SET = {
  PRIMARY: "var(--template-color-primary)",
  SECONDARY: "var(--template-color-secondary)",
};

export const QUESTION_LIST: string[] = [
  "올해 나한테 고마웠던 일 있어?",
  "내년에 나랑 같이 해보고 싶은 일이 있다면?",
  "내년 봄에 나랑 하고  싶은 일을 계획한다면?",
  "내년에 나랑 같이 가보고 싶은 곳이 있다면?",
  "올해 나에게 못다한 말이 있다면?",
  "올해 나와 함께한 시간 중 기억나는 것은?",
  "올해 내가 했던 말 중 기억나는 것은?",
  "올해 나와 있었던 일 중 가장 웃긴 기억은?",
  "올 한해를 정리하며 나에게 해주고 싶은 말은?",
  "내년의 나에게 해주고 싶은 말은?",
  "올해 나에 대해 새롭게 알게된 사실은?",
  "내가 아직 모르는 너만의 TMI는?",
  "올해 내가 가장 잘했다고 생각하는 일은?",
  "나의 새해 목표를 하나만 대신 세워준다면?",
  "2024 나와 있었던 일 중 제일 기억에 남는 일은?",
  "2024가 끝나가는 지금! 나와 하지 못해 아쉬운 일은?",
  "올해 나랑 같이 한 것 중에 가장 잘했다고 생각하는 일은?",
  "너와 나의 한 해를 3단어로 정리해본다면?",
  "올 한 해 나는 너에게 어떤 사람이었어?",
  "올해 나랑 하고 싶었는데 못한 일은?",
  "한해를 돌아보며 나에게 추천해주고 싶은 노래는?",
  "한해를 돌아보며 나에게 추천해주고 싶은 영화는?",
  "올해의 마지막 날, 나에게 해주고 싶은 말은?",
  "올해 우리가 같이 갔던 장소 중 제일 기억에 남는 장소는?",
  "올해 우리가 먹은 음식 중 가장 맛있었던 음식은?",
]; 