export const API_BASE_URL = "https://api.yearlymailbox.com";

export const COLOR_SET = {
  PRIMARY: "var(--template-color-primary)",
  SECONDARY: "var(--template-color-secondary)",
};

export const QUESTION_LIST: string[] = [
  "내 첫인상은 어땠어? (예: 조용해 보였어, 활발할 것 같았어, 웃음이 많아 보였어 등)",
  "내 퍼스널 컬러는 뭐일 것 같아? 제일 잘 어울릴 것 같은 색도 알려줘!",
  "나랑 닮았다고 생각하는 연예인이나 캐릭터가 있다면 알려줘!",
  "내 MBTI는 뭐일 것 같아?",
  "나를 이모지로 표현해 줘! (예: 🎁 ✍🏻 📚 🐶)",

  "나는 새로운 사람과 쉽게 친해지는 편일 것 같아, 시간이 좀 걸리는 편일 것 같아?",
  "나는 친해지면 어떤 스타일일 것 같아? (예: 장난 많이 치는 편, 잘 챙겨주는 편, 리액션 좋은 편 등)",
  "내가 고민이 있을 때 어떻게 해결할 것 같아? (예: 혼자서 끙끙 앓을 것 같아, 친구들과 고민을 나눌 것 같아 등)",
  "친구들 사이에서 나는 어떤 역할을 할 것 같아? (예: 리더, 분위기 메이커, 조용히 서포트하는 스타일 등)",
  "내 성격을 동물에 비유한다면 무슨 동물일까?",

  "내가 너의 마니또가 된다면, 어떤 행동으로 몰래 널 챙겨줄 것 같아?",
  "나랑 무슨 얘기를 할 때 가장 재미있어?",
  "나랑 뭐 하고 놀 때 가장 재미있어?",
  "내가 좋아할 것 같은 가수나 노래를 추천해 줘!",
  "내가 좋아할 것 같은 유튜브 채널이나 넷플릭스 작품 추천해 줘!",

  "나랑 같이하고 싶은 취미 활동 있어?",
  "내가 어울릴 것 같은 패션 스타일을 추천해줘! (예: 쇠맛, 긱시크 등)",
  "내가 만약 영화 속 주인공라면, 어떤 영화 주인공일 것 같아?",
  "내가 미래에 꼭 해봐야 할 새로운 취미를 하나 추천해 줘!",
  "최근에 너가 먹은 것 중 내가 좋아할 만한 음식을 추천해 줘!",

  "나는 어떤 장르의 책을 좋아할 것 같아?",
  "만약 우리가 같이 여행을 간다면, 나는 어떤 스타일일 것 같아? (예: 계획형, 즉흥형, 맛집 탐방러, 사진 마니아 등)",
  "나랑 함께 여행 가고 싶은 나라 있어? 이유도 말해줘!",
  "내가 브이로그 유튜버가 된다면 채널명을 뭘로 하는 게 좋을까?",

  "내 인스타그램 아이디 추천해 줘!",
  "내가 만약 유튜버가 된다면 어떤 콘텐츠를 할 것 같아?",
  "우리 반에서 좀비가 나온다면, 나는 생존 확률이 몇 퍼센트일까?",
  "내가 바퀴벌레가 된다면 나에게 해줄 첫마디는?",
  "내가 가장 중요하게 생각하는 가치는 무엇일까? (예: 우정, 성실함, 유머, 솔직함 등)",

  "미래의 나에게 어울리는 직업 추천해 줘!",
  "나중에 내가 유명해진다면, 어떤 이유로 유명해질 것 같아?",
  "10년 후의 나에게 편지를 쓴다면, 어떤 말을 해주고 싶어?",
  "1년 뒤, 우리 반이 헤어지게 되는 날 우린 무슨 얘기를 나누게 될까?",
  "내가 나중에 유명인이 돼서 유튜브에 나온다면, 너는 뭐라고 댓글을 달아줄거야?",
  "내가 가장 소중하게 여길 것 같은 순간은 언제일까?",
];
